Autodesk.Revit.DB.ElementMulticlassFilter.#ctor(System.Collections.Generic.IList{System.Type},System.Boolean)
Constructs a filter using multiple types
typeList:
The list of types to match
inverted:
True if the filter should match all elements which are not of the given class.
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more input types are not subclasses of Element.
-or-
One or more of the types do not exist in Revit's native object model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementMulticlassFilter.#ctor(System.Collections.Generic.IList{System.Type})
Constructs a filter using multiple types
typeList:
The list of types to match
Throws Autodesk.Revit.Exceptions.ArgumentException:
One or more input types are not subclasses of Element.
-or-
One or more of the types do not exist in Revit's native object model.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2012

Autodesk.Revit.DB.ElementMulticlassFilter
A filter used to match elements by their class, where more than one class of element may be passed.
Remarks:
Only elements whose class is an exact match to one of the input classes,
or elements whose type is derived from the input class will pass the collector.
There is a small subset of Element subclasses in the API that are not supported
by this filter.  These classes exist in the API, but not in Revit's native object model,
which means that this filter doesn't support them.  In order to use a class filter to
find elements of these types, it is necessary to use a higher level class and then
process the results further to find elements matching only the subclass. For a list
of subclasses affected by this restriction, consult the documentation for ElementClassFilter.
Since:
2012